# Вариативная самостоятельная работа

### [2.1 Написать программу, позволяющую выполнять подсчет слов в тексте, а также вычислять размер (в символах) каждого слова. Используйте для возвращения результатов подсчета механизм генераторов](https://replit.com/@PolinaLazebniko/sem6-Tema2-VSR-21#main.py)
```python
"""
    Лазебникова Полина 
    ИВТ 3 курс
    группа 1.1

    Вариативная самостоятельная работа 
    Задание 2.1: Написать программу, позволяющую выполнять подсчет слов в тексте, а 
    также вычислять размер (в символах) каждого слова. Используйте для возвращения результатов 
    подсчета механизм генераторов.
"""
def word_length(text):
    total = len(text.split())
    print('Word Count: {}'.format(total))
    for num, word in enumerate(text.split(), 1):
        yield '{}-{}: {}'.format(num, total, len(word))

text = 'Have a nice weekend'
wl = word_length(text)

for word in wl:
    print(word)
```
